### Pandas DataFrames

Pandas DataFrames are two-dimensional data structures with labeled rows and columns, that can hold many data types. If you are familiar with Excel, you can think of Pandas DataFrames as being similar to a spreadsheet. We can create Pandas DataFrames manually or by loading data from a file. In this lesson, we will start by learning how to create Pandas DataFrames manually from dictionaries, and later we will see how we can load data into a DataFrame from a data file.

Create a DataFrame manually
We will start by creating a DataFrame manually from a dictionary of Pandas Series. It is a two-step process:

* The first step is to create the dictionary of Pandas Series.
* After the dictionary is created we can then pass the dictionary to the `pd.DataFrame()` function.
    
We will create a dictionary that contains items purchased by two people, Alice and Bob, on an online store. The Pandas Series will use the price of the items purchased as data, and the purchased items will be used as the index labels to the Pandas Series. Let's see how this done in code:

In [1]:
# Step 1 to create dictionary of the Pandas Series 

import pandas as pd 

items = { 'Bob': pd.Series([245, 25, 55], index=['bike', 'pants', 'watch']),
         'Alice' : pd.Series([40, 110, 500, 45], index =['book', 'glasses', 'bike', 'pants'])
}

print(type(items))

<class 'dict'>

In [2]:
# Step 2 : pass the  ctionary to the pd.DataFrame()

shopping_cart = pd.DataFrame(items)
shopping_cart # the rows are the union of the index labels we provided in the series, Column labels taken from the keys of the dict 

# There are NaN values : means Not a Number, we have to handle them wisely as we can not pass them directly to the ML models

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [3]:
# IF we don't provide the index labels then the pandas will give the index labels automatically with the numarical numbers 

data = {
    'Bob': pd.Series([245, 25, 55]),
    'Alice' : pd.Series([40, 110, 500, 45])
}

df = pd.DataFrame(data)

print(df) # Here we can see the pandas allocated numbering for the rows from 0 just like numpy

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [4]:
# We can extract the info using the attributes 
shopping_cart.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [5]:
shopping_cart.columns

Index(['Bob', 'Alice'], dtype='object')

In [6]:
shopping_cart.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [7]:
shopping_cart.shape

(5, 2)

In [8]:
shopping_cart.ndim

2

In [9]:
shopping_cart.size

10

In [10]:
# Let's see the dataframes which are derived from the another dataframe we created 

bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [11]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [12]:
alice_sel_shopping_cart = pd.DataFrame(items, index=['glasses', 'bike'], columns=['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [13]:
data = {
    'Integers' : [1, 2, 3],
    'Floats' : [4.5, 8.2, 9.6]
}

df = pd.DataFrame(data)
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [14]:
data = {
    'Integers' : [1, 2, 3],
    'Floats' : [4.5, 8.2, 9.6]
}

df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [15]:
items = [{'bikes' : 20, 'pants' : 30, 'watches': 35}, {'watches':10, 'glasses':50, 'bikes':15, 'pants':5}]


store_items = pd.DataFrame(items)
store_items

   bikes  pants  watches  glasses
0     20     30       35      NaN
1     15      5       10     50.0

In [16]:
store_items = pd.DataFrame(items, index=['Store 1', 'Store 2'])
store_items

         bikes  pants  watches  glasses
Store 1     20     30       35      NaN
Store 2     15      5       10     50.0

In [17]:
# We can access elements in the dataFrame in different ways
import pandas as pd 

items = [{'bikes' : 20, 'pants' : 30, 'watches': 35}, {'watches':10, 'glasses':50, 'bikes':15, 'pants':5}]

store_items = pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [18]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [19]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [20]:
store_items.loc[['store 1']]

         bikes  pants  watches  glasses
store 1     20     30       35      NaN

In [21]:
# we can access specific element sing df[colum][row]
store_items['bikes']['store 2']

15

In [22]:
# Add column 
store_items['shirts'] = [15, 2]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

In [23]:
# We can create the new columns using the existing columns and do arithmetic operations on them 

store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       2      7

In [24]:
# We can add two dataframes together as follows 

new_items = [{'bikes': 20, 'pants':30, 'watches': 35, 'glasses':4}]

new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [25]:
'''store_items = store_items.append(new_store)
store_items'''

# We append store 3 to our store_items DataFrame
store_items = pd.concat([store_items, new_store])

# We display the modified DataFrame
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     2.0    7.0
store 3     20     30       35      4.0     NaN    NaN

In [26]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  suits  new_watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0     2.0    7.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0

In [27]:
# Now let's add a new column called shoes insert(location, name, values)
store_items.insert(5, 'shoes', [8, 5, 0])
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits  new_watches
store 1     20     30       35      NaN    15.0      8   45.0          NaN
store 2     15      5       10     50.0     2.0      5    7.0         10.0
store 3     20     30       35      4.0     NaN      0    NaN         35.0

In [28]:
# We can delete the column using the pop 

store_items.pop('new_watches')
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35      NaN    15.0      8   45.0
store 2     15      5       10     50.0     2.0      5    7.0
store 3     20     30       35      4.0     NaN      0    NaN

In [29]:
# Using the drop  method for columns and also rows if required axis = 0 for rows and 1 for columns 

store_items = store_items.drop(['store 1', 'store 2'], axis = 0)
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits
store 3     20     30       35      4.0     NaN      0    NaN

In [30]:
# We can also rename columns
store_items = store_items.rename(columns={'bikes': 'hats'})
store_items

         hats  pants  watches  glasses  shirts  shoes  suits
store 3    20     30       35      4.0     NaN      0    NaN

In [31]:
# We can also rename rows
store_items = store_items.rename(index={'store 3': 'last store'})
store_items

            hats  pants  watches  glasses  shirts  shoes  suits
last store    20     30       35      4.0     NaN      0    NaN

In [32]:
store_items = store_items.set_index('pants') # setting the existing column as a index 
store_items

       hats  watches  glasses  shirts  shoes  suits
pants
30       20       35      4.0     NaN      0    NaN

### Dealing with NaN

In [33]:
import pandas as pd

items= [{'bikes': 20, 'pants': 30,'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
         {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants' :5, 'shirts': 2, 'shoes' :5, 'suits': 7},
         {' bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes' : 10} ]

store_items = pd.DataFrame(items, index=['store 1', 'store 2', 'store 3'])
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses   bikes
store 1   20.0     30       35    15.0      8   45.0      NaN     NaN
store 2   15.0      5       10     2.0      5    7.0     50.0     NaN
store 3    NaN     30       35     NaN     10    NaN      4.0    20.0

In [34]:
# we have to use the methods to count the total number of NaN values, because we can not see all the values in the arge datasets

x = store_items.isnull().sum().sum()
print(x)

6

In [35]:
# Let's break down the above 
x = store_items.isnull()
x

         bikes  pants  watches  shirts  shoes  suits  glasses   bikes
store 1  False  False    False   False  False  False     True    True
store 2  False  False    False   False  False  False    False    True
store 3   True  False    False    True  False   True    False   False

In [36]:
x = store_items.isnull().sum() # It counts the total NaNs at each row
x

bikes      1
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
 bikes     2
dtype: int64

In [37]:
# now it will calculate total NaNs using another time sum()
x = store_items.isnull().sum().sum()
print(x)

6

In [38]:
store_items.count() # it will give the true values

bikes      2
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
 bikes     1
dtype: int64

In [39]:
store_items.count().sum()

18

In [40]:
store_items.dropna(axis=0) # it will eliminate the rows with NaN values

Empty DataFrame
Columns: [bikes, pants, watches, shirts, shoes, suits, glasses,  bikes]
Index: []

In [41]:
store_items.dropna(axis=1) # eliminate the columns with Nan Values # if we keep inplace = True then it will be modified in original array

         pants  watches  shoes
store 1     30       35      8
store 2      5       10      5
store 3     30       35     10

In [42]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses   bikes
store 1   20.0     30       35    15.0      8   45.0      NaN     NaN
store 2   15.0      5       10     2.0      5    7.0     50.0     NaN
store 3    NaN     30       35     NaN     10    NaN      4.0    20.0

In [43]:
# Let's fill the NaN values with 0
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses   bikes
store 1   20.0     30       35    15.0      8   45.0      0.0     0.0
store 2   15.0      5       10     2.0      5    7.0     50.0     0.0
store 3    0.0     30       35     0.0     10    0.0      4.0    20.0

In [44]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses   bikes
store 1   20.0     30       35    15.0      8   45.0      NaN     NaN
store 2   15.0      5       10     2.0      5    7.0     50.0     NaN
store 3    NaN     30       35     NaN     10    NaN      4.0    20.0

In [45]:
# now try to replace nan with the previous data with respective columns and rows to the element 

store_items.fillna(method='ffill', axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses   bikes
store 1   20.0     30       35    15.0      8   45.0      NaN     NaN
store 2   15.0      5       10     2.0      5    7.0     50.0     NaN
store 3   15.0     30       35     2.0     10    7.0      4.0    20.0

In [46]:
store_items.fillna(method='ffill', axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses   bikes
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0    45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0    50.0
store 3    NaN   30.0     35.0    35.0   10.0   10.0      4.0    20.0

In [47]:
store_items.fillna(method='backfill', axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses   bikes
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN     NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0     NaN
store 3   30.0   30.0     35.0    10.0   10.0    4.0      4.0    20.0

In [48]:
store_items.fillna(method='backfill', axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses   bikes
store 1   20.0     30       35    15.0      8   45.0     50.0    20.0
store 2   15.0      5       10     2.0      5    7.0     50.0    20.0
store 3    NaN     30       35     NaN     10    NaN      4.0    20.0

In [49]:
store_items.interpolate(method='linear', axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses   bikes
store 1   20.0     30       35    15.0      8   45.0      NaN     NaN
store 2   15.0      5       10     2.0      5    7.0     50.0     NaN
store 3   15.0     30       35     2.0     10    7.0      4.0    20.0

In [50]:
store_items.interpolate(method='linear', axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses   bikes
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0    45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0    50.0
store 3    NaN   30.0     35.0    22.5   10.0    7.0      4.0    20.0

### Load Data

In [ ]:
# We load Google stock data in a DataFrame
Google_stock = pd.read_csv('./GOOG.csv')

# We print some information about Google_stock
print('Google_stock is of type:', type(Google_stock))
print('Google_stock has shape:', Google_stock.shape)